index.html
<!DOCTYPE html>
<html lang="zh-CN">
<head>
<!-- 2021-01-09 周六 19:47 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>rgb-24bit's notebook</title>
<meta name="generator" content="Org mode">
<link rel="stylesheet" type="text/css" href="https://rgb-24bit.github.io/blog/misc/style.css">
<!-- Global site tag (gtag.js) - Google Analytics -->
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="https://rgb-24bit.github.io/notebook/"> UP </a>
 |
 <a accesskey="H" href="https://rgb-24bit.github.io"> HOME </a>
</div><div id="content">
<h1 class="title">rgb-24bit's notebook</h1>
<div id="table-of-contents">
<h2>&#30446;&#24405;</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org19ceb33">1. algorithm</a></li>
<li><a href="#org7672fee">2. android</a></li>
<li><a href="#orgf1cbb5e">3. c-c++</a></li>
<li><a href="#org971073e">4. compile</a></li>
<li><a href="#org562d28a">5. database</a></li>
<li><a href="#org288def9">6. devops</a></li>
<li><a href="#org77c7107">7. dotnet</a></li>
<li><a href="#org265f77a">8. emacs</a></li>
<li><a href="#org30a41ef">9. front-end</a></li>
<li><a href="#org75645b8">10. git</a></li>
<li><a href="#orgace47d0">11. go</a></li>
<li><a href="#org7930566">12. java</a></li>
<li><a href="#org3e1ed82">13. lang</a></li>
<li><a href="#org3139583">14. linux</a></li>
<li><a href="#orgdb2665a">15. mac</a></li>
<li><a href="#org85a4c0f">16. microservice</a></li>
<li><a href="#orgd7dcc7f">17. misc</a></li>
<li><a href="#org410eac0">18. network</a></li>
<li><a href="#org1bba976">19. os</a></li>
<li><a href="#org6f37fb5">20. python</a></li>
<li><a href="#org0e12d37">21. solution</a></li>
<li><a href="#orgf1ebf46">22. tools</a></li>
<li><a href="#org284a2a8">23. windows</a></li>
</ul>
</div>
</div>
<div id="outline-container-org19ceb33" class="outline-2">
<h2 id="org19ceb33"><span class="section-number-2">1</span> algorithm</h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li><a href="notebook/algorithm/advanced.html">高级数据结构</a></li>
<li><a href="notebook/algorithm/bit.html">位运算</a></li>
<li><a href="notebook/algorithm/classic.html">经典问题</a></li>
<li><a href="notebook/algorithm/containers.html">Containers</a></li>
<li><a href="notebook/algorithm/digest.html">摘要算法</a></li>
<li><a href="notebook/algorithm/encrypt.html">加密算法</a></li>
<li><a href="notebook/algorithm/graph.html">Graph</a></li>
<li><a href="notebook/algorithm/math.html">数学问题</a></li>
<li><a href="notebook/algorithm/misc.html">Misc</a></li>
<li><a href="notebook/algorithm/question.html">相关问题</a></li>
<li><a href="notebook/algorithm/random.html">随机数相关</a></li>
<li><a href="notebook/algorithm/search.html">Search</a></li>
<li><a href="notebook/algorithm/sort.html">Sort</a></li>
<li><a href="notebook/algorithm/string.html">字符串</a></li>
<li><a href="notebook/algorithm/tree.html">Tree</a></li>
</ul>
</div>
</div>
<div id="outline-container-org7672fee" class="outline-2">
<h2 id="org7672fee"><span class="section-number-2">2</span> android</h2>
<div class="outline-text-2" id="text-2">
<ul class="org-ul">
<li><a href="notebook/android/activity.html">Android - Activity</a></li>
<li><a href="notebook/android/content-provider.html">Android - 内容提供器</a></li>
<li><a href="notebook/android/fragment.html">Android - Fragment</a></li>
<li><a href="notebook/android/layout.html">Android - Layout</a></li>
<li><a href="notebook/android/misc.html">Android - Misc</a></li>
<li><a href="notebook/android/resource.html">Android - Resource</a></li>
<li><a href="notebook/android/service.html">Android - Service</a></li>
<li><a href="notebook/android/tools.html">Android Tools</a></li>
</ul>
</div>
</div>
<div id="outline-container-orgf1cbb5e" class="outline-2">
<h2 id="orgf1cbb5e"><span class="section-number-2">3</span> c-c++</h2>
<div class="outline-text-2" id="text-3">
<ul class="org-ul">
<li><a href="notebook/c-c++/c-question.html">C 语言问题集</a></li>
<li><a href="notebook/c-c++/c-trick.html">C 语言使用技巧</a></li>
<li><a href="notebook/c-c++/c.html">C 语言</a></li>
<li><a href="notebook/c-c++/cpp.html">C++</a></li>
<li><a href="notebook/c-c++/gcc-gdb.html">GCC &amp; GDB</a></li>
<li><a href="notebook/c-c++/libc.html">C 标准库</a></li>
<li><a href="notebook/c-c++/macro.html">强大的宏</a></li>
<li><a href="notebook/c-c++/makefile.html">Makefile</a></li>
<li><a href="notebook/c-c++/pointer.html">指针</a></li>
</ul>
</div>
</div>
<div id="outline-container-org971073e" class="outline-2">
<h2 id="org971073e"><span class="section-number-2">4</span> compile</h2>
<div class="outline-text-2" id="text-4">
<ul class="org-ul">
<li><a href="notebook/compile/grammar.html">编译原理 - 语法分析</a></li>
<li><a href="notebook/compile/lex.html">编译原理 - 词法分析</a></li>
<li><a href="notebook/compile/question.html">相关问题</a></li>
<li><a href="notebook/compile/simple-compile.html">编译原理 - 简单的语法制导翻译器</a></li>
</ul>
</div>
</div>
<div id="outline-container-org562d28a" class="outline-2">
<h2 id="org562d28a"><span class="section-number-2">5</span> database</h2>
<div class="outline-text-2" id="text-5">
<ul class="org-ul">
<li><b>mysql</b>
<ul class="org-ul">
<li><a href="notebook/database/mysql/innodb.html">InnoDB 引擎相关</a></li>
<li><a href="notebook/database/mysql/mysql.html">MySQL</a></li>
<li><a href="notebook/database/mysql/question.html">相关问题</a></li>
</ul></li>
<li><a href="notebook/database/mongo.html">MongoDB</a></li>
<li><a href="notebook/database/mssql.html">SQL Server</a></li>
<li><a href="notebook/database/others.html">Others</a></li>
<li><a href="notebook/database/question.html">通用问题集</a></li>
<li><a href="notebook/database/redis.html">Redis</a></li>
<li><a href="notebook/database/sqlite3.html">SQLite3</a></li>
<li><a href="notebook/database/standsql.html">Standard SQL</a></li>
<li><a href="notebook/database/theory.html">数据库理论</a></li>
<li><a href="notebook/database/tsdb.html">TSDB - 时序数据库</a></li>
<li><a href="notebook/database/utils.html">Utils</a></li>
</ul>
</div>
</div>
<div id="outline-container-org288def9" class="outline-2">
<h2 id="org288def9"><span class="section-number-2">6</span> devops</h2>
<div class="outline-text-2" id="text-6">
<ul class="org-ul">
<li><a href="notebook/devops/ci.html">持续集成</a></li>
<li><a href="notebook/devops/concept.html">相关概念</a></li>
<li><a href="notebook/devops/nginx.html">Nginx</a></li>
</ul>
</div>
</div>
<div id="outline-container-org77c7107" class="outline-2">
<h2 id="org77c7107"><span class="section-number-2">7</span> dotnet</h2>
<div class="outline-text-2" id="text-7">
<ul class="org-ul">
<li><a href="notebook/dotnet/csharp-feature.html">.NET - C# 高级特性</a></li>
<li><a href="notebook/dotnet/csharp-note.html">.NET - C# 基础</a></li>
<li><a href="notebook/dotnet/misc.html">.NET - Misc</a></li>
<li><a href="notebook/dotnet/winforms.html">.NET - WinForm 相关笔记</a></li>
</ul>
</div>
</div>
<div id="outline-container-org265f77a" class="outline-2">
<h2 id="org265f77a"><span class="section-number-2">8</span> emacs</h2>
<div class="outline-text-2" id="text-8">
<ul class="org-ul">
<li><a href="notebook/emacs/beautify.html">Emacs Beautify</a></li>
<li><a href="notebook/emacs/elisp.html">Emacs Lisp</a></li>
<li><a href="notebook/emacs/emacs.html">Emacs</a></li>
<li><a href="notebook/emacs/info.html">Info Mode</a></li>
<li><a href="notebook/emacs/latex.html">Edit Latex</a></li>
<li><a href="notebook/emacs/minor-mode.html">minor mode</a></li>
<li><a href="notebook/emacs/misc.html">Misc</a></li>
<li><a href="notebook/emacs/org-mode.html">Org mode</a></li>
<li><a href="notebook/emacs/package.html">Emacs - Package</a></li>
<li><a href="notebook/emacs/question.html">Emacs - 问题集</a></li>
<li><a href="notebook/emacs/regex.html">Emacs - 正则表达式</a></li>
<li><a href="notebook/emacs/scimax.html">scimax</a></li>
<li><a href="notebook/emacs/site-lisp.html">Emacs Site Lisp</a></li>
<li><a href="notebook/emacs/spacemacs.html">Spacemacs</a></li>
<li><a href="notebook/emacs/trick.html">使用技巧</a></li>
<li><a href="notebook/emacs/utils.html">Emacs - 实用功能</a></li>
<li><a href="notebook/emacs/vc.html">Version Control</a></li>
</ul>
</div>
</div>
<div id="outline-container-org30a41ef" class="outline-2">
<h2 id="org30a41ef"><span class="section-number-2">9</span> front-end</h2>
<div class="outline-text-2" id="text-9">
<ul class="org-ul">
<li><b>vue</b>
<ul class="org-ul">
<li><a href="notebook/front-end/vue/element-ui.html">Element UI</a></li>
<li><a href="notebook/front-end/vue/question.html">相关问题</a></li>
<li><a href="notebook/front-end/vue/vue.html">Vue.JS</a></li>
</ul></li>
<li><a href="notebook/front-end/async.html">异步编程模型</a></li>
<li><a href="notebook/front-end/css.html">CSS</a></li>
<li><a href="notebook/front-end/dom.html">JavaScript DOM API</a></li>
<li><a href="notebook/front-end/es5.html">ECMAScript 5</a></li>
<li><a href="notebook/front-end/es6.html">ECMAScript 6</a></li>
<li><a href="notebook/front-end/glossary.html">Glossary</a></li>
<li><a href="notebook/front-end/html.html">HTML</a></li>
<li><a href="notebook/front-end/library.html">JavaScript Library</a></li>
<li><a href="notebook/front-end/misc.html">Misc</a></li>
<li><a href="notebook/front-end/nodejs.html">Node.js</a></li>
<li><a href="notebook/front-end/question.html">相关问题</a></li>
<li><a href="notebook/front-end/security.html">Security</a></li>
<li><a href="notebook/front-end/technology.html">前端相关技术了解</a></li>
</ul>
</div>
</div>
